In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [1,2,3]

In [3]:
data = np.array(data)

In [4]:
type(data)

numpy.ndarray

In [5]:
data = [1,2,3]

In [6]:
# Series 는 1차원 배열이다.
pd_data = pd.Series(data)

In [8]:
type(pd_data)

pandas.core.series.Series

In [9]:
#index가 자동으로 추가된다
pd_data

0    1
1    2
2    3
dtype: int64

In [10]:
# 넘파이 배열도 받을 수 있다.
pd_data = pd.Series(np.array(data))

In [11]:
# 튜플도 가능
pd.Series((1,2,3))

0    1
1    2
2    3
dtype: int64

In [18]:
# dic의 키값은 인덱스처럼 된다. 고정된 길이의 딕셔너리처럼 생각
dic = {0:1, 1:1, 2:2,4:3}
pd.Series(dic)

0    1
1    1
2    2
4    3
dtype: int64

In [19]:
# index 값을 따로 지정 가능하다
a = pd.Series([1,2,3], index=['a','1','2'])

In [20]:
a

a    1
1    2
2    3
dtype: int64

In [21]:
# 인덱스 지정으로 원하는 값 지정 가능하다.
a['a'] = 1

In [22]:
a[['a','2']]

a    1
2    3
dtype: int64

In [26]:
print(a.index)

# 모양
print(a.shape)

#차원
print(a.ndim)

# 원소 갯수
print(a.size)
# 원소 타입
print(a.dtype)

Index(['a', '1', '2'], dtype='object')
(3,)
1
3
int64

In [27]:
dic = {'a':1,'b':1,'c':2}

In [28]:
a = pd.Series(dic)
a = pd.Series([0,1,2])
b = pd.Series([2,3,4])

In [29]:
# 사칙연산 가능
a+b

0    2
1    4
2    6
dtype: int64

In [32]:
#  .T는 트랜스포즈
a.T @b

11

In [33]:
a = pd.Series([0,1,2],index=['a','b','c'])
b = pd.Series([2,3,4])

In [35]:
# index가 같아야 계산이 된다. 인덱스를 일치시켜야 한다
a+b

a   NaN
b   NaN
c   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [36]:
# data frame은 Series의 연장이다. Series의 열을 합쳐서 만들어진다.
dic = {'이름':['김수안','김수정','박동윤','강이안','강지안'],
       '나이':[19,23,22,19,16],
       '성별':['여','여','남','여','남'],
       '평정':[4.35,4.23,4.45,4.37,4.25]
      }

data = pd.DataFrame(dic)
type(data)

pandas.core.frame.DataFrame

In [38]:
# 딕셔너리의 키 값이 변수명이 된다
data

    이름  나이 성별    평정
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [40]:
# 데이터 프레임에서는 원소 속성으로 dtypes를 쓴다 S주의
data.dtypes

이름     object
나이      int64
성별     object
평정    float64
dtype: object

In [43]:
# 리스트 안의 리스트는 행을 의미한다.
data_list = [['김수안',19,'여',4.35],['김수정',23,'여',4.23],['박동윤',22,'남',4.45]]

In [44]:
pd.DataFrame(data_list)

     0   1  2     3
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45

In [48]:
# index 값 바꾸기
pd.DataFrame(data_list,index=['a','b','c'])

     0   1  2     3
a  김수안  19  여  4.35
b  김수정  23  여  4.23
c  박동윤  22  남  4.45

In [51]:
# 속성 이름 바꾸기 속성과 인덱스는 통으로 바꿔야한다.(개별로 안바뀐다.)
data = pd.DataFrame(data_list,index=['a','b','c'],columns=['이름','나이','성별','평점'])

In [52]:
data

    이름  나이 성별    평점
a  김수안  19  여  4.35
b  김수정  23  여  4.23
c  박동윤  22  남  4.45

In [54]:
data.columns = ['name','age','sex','grade']
data

  name  age sex  grade
a  김수안   19   여   4.35
b  김수정   23   여   4.23
c  박동윤   22   남   4.45

In [55]:
data.index[0]=1

TypeError: Index does not support mutable operations

In [56]:
data_array = np.array([['김수안',19,'여',4.35],['김수정',23,'여',4.23],['박동윤',22,'남',4.45]])

In [57]:
type(data_array)

numpy.ndarray

In [98]:
dic = {'이름':['김수안','김수정','박동윤','강이안','강지안'],
       '나이':[19,23,22,19,16],
       '성별':['여','여','남','여','남'],
       '평정':[4.35,4.23,4.45,4.37,4.25]
      }


data = pd.DataFrame(dic)
data

    이름  나이 성별    평정
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [99]:
#data = pd.DataFrame(data_array,index=['a','b','c'],columns=['이름','나이','성별','평점'])

In [100]:
# column 에서 찾기
data['성별']

0    여
1    여
2    남
3    여
4    남
Name: 성별, dtype: object

In [101]:
data['성별'][0:3]

0    여
1    여
2    남
Name: 성별, dtype: object

In [102]:
data[['성별','이름']][0:2]

  성별   이름
0  여  김수안
1  여  김수정

In [103]:
# 슬라이싱 가능
data[0:2]

    이름  나이 성별    평정
0  김수안  19  여  4.35
1  김수정  23  여  4.23

In [104]:
# 위치   인덱스로 접근해서 가져온다. 선 인덱후 후 속성
# 개별적인 위치 접근이 가능하다.
data.loc[0:2,['이름','나이']]

    이름  나이
0  김수안  19
1  김수정  23
2  박동윤  22

In [105]:
# 행과 열의 슬라이싱으로 찾는다
data.iloc[:4,:2]

    이름  나이
0  김수안  19
1  김수정  23
2  박동윤  22
3  강이안  19

In [107]:
# loc는 개별접근일때 인덱스 이름 그대로 사용해야한다.
# colum명 또는 행의 index를 사용한다
data.index = ['a','b','c','d','e']
data.loc[['a','b','c'],['이름','나이']]

    이름  나이
a  김수안  19
b  김수정  23
c  박동윤  22

In [110]:
# iloc는 행과 열의위치를 이용해서 데이터 선택
data.iloc[:5,:4]

    이름  나이 성별    평정
a  김수안  19  여  4.35
b  김수정  23  여  4.23
c  박동윤  22  남  4.45
d  강이안  19  여  4.37
e  강지안  16  남  4.25

In [117]:
# axis 0은 행방향 1은 열방향 , 실제 삭제된 값 저장은 inplace = True 를 사용하면 된다.
data.drop(['a','c'],axis=0)

    이름  나이 성별    평정
b  김수정  23  여  4.23
d  강이안  19  여  4.37
e  강지안  16  남  4.25

In [116]:
data.drop(['성별'],axis=1)

    이름  나이    평정
a  김수안  19  4.35
b  김수정  23  4.23
c  박동윤  22  4.45
d  강이안  19  4.37
e  강지안  16  4.25

In [118]:
# missing value 찾기
data.isna()

      이름     나이     성별     평정
a  False  False  False  False
b  False  False  False  False
c  False  False  False  False
d  False  False  False  False
e  False  False  False  False

In [119]:
data['연락처'] = [None,None,None,None,None]

In [120]:
data

    이름  나이 성별    평정   연락처
a  김수안  19  여  4.35  None
b  김수정  23  여  4.23  None
c  박동윤  22  남  4.45  None
d  강이안  19  여  4.37  None
e  강지안  16  남  4.25  None

In [122]:
# null 찾기
data.isnull()

      이름     나이     성별     평정   연락처
a  False  False  False  False  True
b  False  False  False  False  True
c  False  False  False  False  True
d  False  False  False  False  True
e  False  False  False  False  True

In [124]:
# missing value
data.isna()

      이름     나이     성별     평정   연락처
a  False  False  False  False  True
b  False  False  False  False  True
c  False  False  False  False  True
d  False  False  False  False  True
e  False  False  False  False  True